Revit 2024 API
LinkConversionData Class
 This class contains the information necessary to re-create a Revit document from an external source.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class LinkConversionData : IDisposable
Visual Basic
Public Class LinkConversionData _
	Implements IDisposable
Visual C++
public ref class LinkConversionData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LinkConversionData
See Also
LinkConversionData Members
Autodesk.Revit.DB Namespace